import java.util.Scanner;

//Вася хочет купить себе новый телефон. В магазине он видит телефоны разных цен: 10000 евро, 20000 евро,
// 30000 евро и 40000 евро. Задание: Напишите программу, которая поможет Васе выбрать телефон, подходящий по цене.
public class Hw083 {
    public static void main(String[] args){
        phone();
    }
    public static void phone(){

        Scanner scanner = new Scanner(System.in);
        System.out.println("Товар стоит 100 евро, Вы согласны на эту цену?");
        double cash = scanner.nextDouble();


        }
    }

