package Hw2;

public class Hw2 {

    //Создайте анонимный класс, реализующий Comparator<String>. Сравнивайте строки по количеству гласных букв.
    //Подсказка: Используйте метод charAt() для прохода по каждому символу строки и подсчета гласных.
    //Используя лямбда-выражение, реализуйте Comparator<String>, который сравнивает строки по количеству согласных букв.
    //Подсказка: Также можно использовать метод charAt() для подсчета согласных. ~~3. Предикаты: Создайте предикат, который проверяет, является ли целое число степенью двойки.
    //Подсказка: Число является степенью двойки, если n & (n - 1) == 0 и n > 0.~~
    //У вас есть класс Student с полями name (имя), age (возраст), и gpa (средний балл). Ваша задача — написать программу, которая сможет фильтровать и сортировать список студентов по различным критериям.
    //Подзадачи:
    //
    //1. Предикат: Создайте предикат, который проверяет, является ли студент совершеннолетним (возраст 18 и выше).
    //
    //Создайте метод, который проверяет, является ли студент совершеннолетним (возраст 18 и выше).
    //Лямбда-выражение и Comparator: Используя лямбда-выражение, создайте компаратор, который сортирует студентов по среднему баллу (GPA) в убывающем порядке.
    //Итоговая задача: Создайте метод, который принимает массив студентов и использует предикат и компаратор для:
    //Фильтрации списка, оставляя только совершеннолетних студентов.
    //Сортировки отфильтрованного списка по среднему баллу в убывающем порядке.
}
